import React, { useState, useRef, useEffect } from "react";
import Introduction from "../Introduction/Introduction";
import Slider from "../slider/Slider";
import Introduce from "./../introduceSlider/Introduce";
import RoadMapComp from "./../roadMap/RoadMapComp";
import {
  employment_title,
  comments_title,
  employment,
  comments,
  Challenges,
  Challenges_title,
  history_title,
  road_map,
} from "../../data";
import "./main.css";

const Main = () => {
  const [vid, setVid] = useState(false);
  const [vidSrc, setVidSrc] = useState("");

  const videoRef = useRef();

  useEffect(() => {
    const handleClickOutside = (event) => {
      if (videoRef.current && !videoRef.current.contains(event.target)) {
        setVid(false);
      }
    };

    document.addEventListener("mousedown", handleClickOutside);

    return () => {
      document.removeEventListener("mousedown", handleClickOutside);
    };
  }, []);

  useEffect(() => {
    const videoEl = videoRef.current;
    if (vid) videoEl.play();

    return () => {
      videoEl.pause();
    };
  }, [vid]);

  return (
    <div className="relative">
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width="800"
        height="500"
        fill="none"
        class="absolute left-0 top-0 hidden md:block"
      >
        <path
          fill="url(#pattern_svg__a)"
          fill-opacity="0.58"
          fill-rule="evenodd"
          d="M294.918-704.726c-54.101 57.277-121.087 135.359-143.444 222.847-7.332 28.694-9.866 58.402-5.57 88.719-4.438 20.721-6.292 41.938-4.817 63.503l-.184.707-.244.947c-4.361 17.065-7.024 34.489-7.563 52.186a281.333 281.333 0 0 0-5.329 18.222 260.904 260.904 0 0 0-2.749 11.905C77.475-192.311 27.452-125.64 8.728-52.372-2.453-8.61-2.473 37.512 15.869 84.554c18.342 47.037 55.024 94.95 117.175 142.329 144.754 110.349 281.198 113.543 386.269 116.002h.006c9.754.228 19.237.45 28.432.751 54.16 1.772 98.157 6.281 128.486 30.73 30.294 24.42 47.085 68.859 46.453 150.884l1.053.008c.633-82.119-16.166-126.981-46.845-151.712-30.644-24.702-75.003-29.192-129.113-30.962-9.175-.301-18.635-.522-28.362-.75l-.043-.001-.028-.001h-.007c-105.061-2.462-241.19-5.651-385.663-115.786-62.04-47.294-98.579-95.062-116.832-141.875C-1.402 37.364-1.388-8.53 9.749-52.11c18.505-72.414 67.712-138.42 114.855-191.528-.473 2.392-.911 4.79-1.313 7.195a333.202 333.202 0 0 0-3.436 8.411c-31.024 41.59-58.194 88.325-70.915 138.105C37.757-46.166 37.737-.043 56.08 46.998c18.341 47.037 55.024 94.951 117.174 142.33C318.008 299.676 454.452 302.87 559.523 305.329c9.756.228 19.242.45 28.438.751 54.16 1.772 98.157 6.282 128.486 30.73 30.294 24.42 47.085 68.859 46.454 150.884l1.053.008c.632-82.118-16.166-126.981-46.846-151.711-30.643-24.702-75.003-29.193-129.112-30.963-9.201-.301-18.687-.523-28.441-.752-105.06-2.462-241.189-5.651-385.662-115.786-62.039-47.294-98.578-95.062-116.832-141.874C38.81-.192 38.824-46.086 49.961-89.667c12.368-48.403 38.455-93.943 68.474-134.682a307.6 307.6 0 0 0-1.793 4.856c-14.842 26.196-26.923 53.797-34.233 82.403C71.226-93.329 71.206-47.206 89.549-.164c18.341 47.036 55.023 94.95 117.174 142.329 144.754 110.349 281.198 113.542 386.269 116.001 9.756.229 19.241.451 28.438.752 54.16 1.771 98.157 6.281 128.486 30.73 30.294 24.42 47.085 68.858 46.453 150.884l1.053.008c.633-82.119-16.166-126.981-46.845-151.712-30.644-24.702-75.003-29.193-129.113-30.963-9.2-.301-18.686-.523-28.44-.752-105.061-2.461-241.19-5.651-385.663-115.785C145.322 94.034 108.783 46.266 90.53-.547c-18.252-46.807-18.238-92.702-7.101-136.282 6.799-26.606 17.742-52.347 31.205-76.901a282.521 282.521 0 0 0-6.024 20.312c-11.183 43.761-11.203 89.884 7.14 136.925 18.341 47.037 55.024 94.951 117.174 142.33 144.754 110.349 281.198 113.542 386.269 116.001 9.756.229 19.242.451 28.438.752 54.16 1.771 98.157 6.281 128.486 30.73 30.294 24.42 47.085 68.858 46.454 150.883l1.053.008c.632-82.118-16.166-126.98-46.846-151.711-30.643-24.702-75.003-29.193-129.112-30.963-9.201-.301-18.687-.523-28.441-.752-105.061-2.461-241.189-5.651-385.662-115.786-62.039-47.293-98.578-95.061-116.832-141.874-18.251-46.808-18.238-92.702-7.101-136.283 2.231-8.729 4.908-17.365 7.973-25.896a455.488 455.488 0 0 1 4.219-7.282c-4.231 34.255-.942 69.692 13.086 105.667 18.34 47.037 55.023 94.95 117.174 142.329C396.835 132.009 533.28 135.202 638.351 137.662h.01c9.752.228 19.234.45 28.428.751 54.16 1.772 98.156 6.281 128.486 30.73 30.293 24.42 47.085 68.859 46.453 150.884l1.053.008c.632-82.119-16.166-126.981-46.845-151.712-30.644-24.702-75.004-29.192-129.113-30.963-9.2-.301-18.687-.523-28.441-.751-105.06-2.462-241.189-5.651-385.662-115.786-62.039-47.294-98.578-95.062-116.831-141.875-14.286-36.635-17.382-72.712-12.713-107.557a491.081 491.081 0 0 1 6.592-10.675 732.12 732.12 0 0 1 4.58-5.807c2.021 17.812 6.366 35.844 13.451 54.014 18.341 47.036 55.024 94.95 117.174 142.329C409.727 61.6 546.171 64.794 651.242 67.253h.01c9.753.229 19.235.45 28.428.752 54.16 1.772 98.157 6.281 128.486 30.73 30.294 24.42 47.085 68.859 46.454 150.883l1.053.009c.632-82.119-16.166-126.981-46.846-151.712-30.643-24.702-75.003-29.193-129.112-30.963-9.201-.3-18.687-.523-28.441-.752-105.061-2.461-241.189-5.65-385.662-115.785-62.039-47.294-98.578-95.062-116.832-141.875-7.188-18.436-11.543-36.73-13.502-54.797a845.635 845.635 0 0 1 19.004-22.885c.363.969.733 1.938 1.111 2.908 18.341 47.037 55.024 94.951 117.174 142.329C417.321-13.555 553.765-10.362 658.836-7.903c9.756.228 19.242.45 28.438.751 54.16 1.772 98.157 6.281 128.486 30.73 30.294 24.42 47.085 68.859 46.454 150.884l1.053.008c.632-82.119-16.166-126.98-46.846-151.712C785.778-1.943 741.418-6.434 687.309-8.204c-9.2-.301-18.687-.524-28.441-.752-105.06-2.462-241.189-5.651-385.662-115.786-62.039-47.294-98.578-95.062-116.832-141.874a233.926 233.926 0 0 1-1.308-3.437c8.993-10.434 17.993-20.419 26.773-29.907 20.958 32.395 51.518 64.99 93.949 97.337C420.542-92.275 556.986-89.081 662.057-86.622h.01c9.753.228 19.235.45 28.428.751 54.16 1.772 98.157 6.282 128.486 30.73 30.294 24.42 47.085 68.86 46.454 150.884l1.053.008c.632-82.118-16.166-126.98-46.846-151.711-30.643-24.702-75.003-29.193-129.112-30.963-9.201-.301-18.687-.523-28.441-.752-105.061-2.462-241.189-5.65-385.662-115.786-42.453-32.363-72.966-64.948-93.849-97.297 3.566-3.848 7.095-7.614 10.572-11.294l-.766-.723a1635.043 1635.043 0 0 0-10.394 11.103 268.22 268.22 0 0 1-2.82-4.501c15.971-19.147 32.213-36.912 47.448-53.042l-.765-.723c-15.164 16.054-31.341 33.743-47.263 52.815a261.197 261.197 0 0 1-6.834-11.943c25.664-36.14 54.853-68.728 81.063-96.477l-.765-.723c-26.105 27.637-55.209 60.118-80.853 96.163a241.546 241.546 0 0 1-8.823-18.422c30.514-54.174 72.966-102.411 109.599-141.195l-.766-.723c-36.468 38.609-78.79 86.671-109.352 140.695a230.18 230.18 0 0 1-2.264-5.587 221.086 221.086 0 0 1-6.202-18.187c28.888-72.669 84.887-137.283 131.475-186.606l-.765-.723C237.79-501.82 182.036-437.542 152.918-365.169a211.185 211.185 0 0 1-5.945-27.953 261.494 261.494 0 0 1 2.3-9.777c22.283-87.197 89.083-165.103 143.19-222.385l-.766-.723C237.596-568.731 170.61-490.648 148.253-403.16a266.394 266.394 0 0 0-1.69 7.008c-3.728-29.182-1.141-57.791 5.931-85.466 22.283-87.196 89.083-165.103 143.189-222.385l-.765-.723ZM125.992-245.2c-.313 1.524-.611 3.05-.895 4.579a357.882 357.882 0 0 1 3.295-7.264c-.799.891-1.599 1.786-2.4 2.685Zm4.854-5.412a354.712 354.712 0 0 0-6.536 14.463 220.83 220.83 0 0 0-.45 2.803 671.354 671.354 0 0 1 5.051-6.551 519.513 519.513 0 0 1 5.144-7.936 213.29 213.29 0 0 1-.499-5.772c-.902.993-1.805 1.991-2.71 2.993Zm2.61-4.447-.973 1.069a460.2 460.2 0 0 1 .922-1.864l.051.795Zm1.08.377c.124 1.817.271 3.637.442 5.458a591.877 591.877 0 0 1 17.324-24.599 1483.102 1483.102 0 0 0-17.766 19.141Zm17.588-20.487a1514.904 1514.904 0 0 0-17.682 19.027l-.053-.909-.038-.69c4.588-9.094 9.546-18.036 14.797-26.813a219.927 219.927 0 0 0 2.976 9.385Zm-22.16 23.962a1105.138 1105.138 0 0 0-3.539 3.94c.72-3.369 1.508-6.725 2.363-10.067a276.513 276.513 0 0 1 4.227-14.798c-.065 4.705.023 9.428.27 14.168a377.01 377.01 0 0 0-3.321 6.757Zm-10.167 26.237c.325-.849.653-1.698.985-2.545.481-.644.962-1.287 1.445-1.928l-.066.48a470.286 470.286 0 0 0-2.364 3.993Zm2.481-6.291.254-.336.066-.449-.09.22-.136.334-.094.231Zm31.585-39.009a854.305 854.305 0 0 0-17.94 21.527 588.46 588.46 0 0 1 16.996-24.143c.308.871.623 1.743.944 2.616Zm27.387-30.604c-8.719 9.418-17.66 19.33-26.6 29.691-.331-.908-.656-1.816-.974-2.723 8.056-10.828 16.379-21.312 24.783-31.413.91 1.481 1.841 2.963 2.791 4.445Zm-3.372-5.394a262.166 262.166 0 0 1-6.802-11.839c-7.416 10.487-14.532 21.272-21.189 32.322a218.902 218.902 0 0 0 3.371 10.677c8.01-10.742 16.277-21.141 24.62-31.16Zm-29.129 20.333c-5.131 8.536-9.989 17.231-14.501 26.071a215.546 215.546 0 0 1-.104-15.769c3.047-9.249 6.564-18.381 10.479-27.382a213.413 213.413 0 0 0 4.126 17.08Zm21.771-33.208c-7.35 10.374-14.41 21.042-21.026 31.973a211.863 211.863 0 0 1-4.127-17.541c4.897-11.096 10.396-21.991 16.361-32.657a243.333 243.333 0 0 0 8.792 18.225Zm-9.314-19.446a230.364 230.364 0 0 1-2.592-6.364 222.126 222.126 0 0 1-5.848-16.979c-4.161 10.628-7.737 21.428-10.616 32.375a209.87 209.87 0 0 0 2.876 23.019c4.863-10.889 10.299-21.581 16.18-32.051Zm-16.935 33.754a211.01 211.01 0 0 1-2.935-21.552c-3.851 15.409-6.306 31.105-7.05 47.025 2.948-8.598 6.296-17.093 9.985-25.473Zm8.01-58.739c-3.998 10.09-7.475 20.336-10.334 30.718-1.041-19.42.612-38.555 4.405-57.294a212.824 212.824 0 0 0 5.929 26.576Zm-189.3 339.885c22.357-87.489 89.343-165.571 143.444-222.848l.766.723C53.085-188.532-13.716-110.625-35.999-23.429c-11.136 43.581-11.15 89.476 7.102 136.283 18.253 46.813 54.792 94.581 116.831 141.875 144.473 110.134 280.602 113.324 385.662 115.785 9.754.229 19.241.451 28.441.752 54.109 1.77 98.469 6.261 129.113 30.963 30.679 24.731 47.477 69.593 46.845 151.712l-1.053-.009c.632-82.024-16.16-126.463-46.453-150.883-30.33-24.449-74.326-28.958-128.486-30.73-9.123-.299-18.53-.519-28.203-.746l-.05-.001-.035-.001-.031-.001-.037-.001h-.033l-.032-.001-.018-.001c-105.071-2.459-241.515-5.652-386.268-116.001-62.151-47.379-98.834-95.293-117.175-142.329-18.342-47.042-18.323-93.164-7.14-136.926Zm93.636-201.38C2.516-167.792-64.47-89.71-86.827-2.222-98.01 41.54-98.03 87.662-79.687 134.704c18.34 47.037 55.023 94.951 117.174 142.329 144.754 110.349 281.198 113.543 386.269 116.002h.017l.057.002h.027c9.72.228 19.172.449 28.337.749 54.16 1.772 98.157 6.282 128.486 30.73 30.294 24.42 47.085 68.859 46.453 150.884l1.053.008c.633-82.118-16.166-126.981-46.845-151.711-30.644-24.702-75.003-29.193-129.113-30.963-9.2-.301-18.686-.523-28.44-.752-105.061-2.462-241.19-5.651-385.663-115.786-62.039-47.294-98.578-95.062-116.831-141.874C-96.958 87.514-96.944 41.62-85.807-1.961c22.282-87.197 89.083-165.103 143.19-222.385l-.766-.723ZM-139.336 14.062c22.357-87.488 89.343-165.57 143.444-222.847l.765.723C-49.233-150.78-116.033-72.873-138.316 14.323c-11.137 43.581-11.15 89.475 7.101 136.283 18.253 46.812 54.792 94.58 116.832 141.874 144.472 110.135 280.601 113.325 385.662 115.786 9.754.229 19.24.451 28.441.752 54.109 1.77 98.468 6.261 129.112 30.963 30.679 24.73 47.478 69.593 46.845 151.711l-1.052-.008c.631-82.025-16.16-126.464-46.454-150.884-30.329-24.448-74.326-28.958-128.486-30.73-9.196-.301-18.682-.523-28.438-.751-105.071-2.459-241.515-5.653-386.269-116.001-62.15-47.379-98.833-95.293-117.174-142.33-18.343-47.041-18.323-93.164-7.14-136.926Zm89.35-209.788C-104.087-138.449-171.072-60.367-193.43 27.121c-11.183 43.762-11.202 89.885 7.141 136.926 18.34 47.037 55.023 94.951 117.174 142.33C75.638 416.726 212.083 419.919 317.154 422.378c9.756.228 19.241.45 28.438.751 54.16 1.772 98.156 6.282 128.486 30.73 30.294 24.42 47.085 68.859 46.453 150.884l1.053.008c.632-82.118-16.166-126.98-46.845-151.711-30.644-24.702-75.004-29.193-129.113-30.963-9.2-.301-18.686-.523-28.441-.752-105.06-2.461-241.189-5.651-385.662-115.786-62.039-47.294-98.578-95.062-116.831-141.874-18.252-46.808-18.238-92.702-7.101-136.283 22.282-87.196 89.083-165.103 143.189-222.385l-.766-.723Zm-198.289 234.33c22.357-87.488 89.343-165.571 143.444-222.847l.765.723c-54.106 57.282-120.907 135.188-143.189 222.385-11.137 43.58-11.151 89.475 7.101 136.283 18.253 46.812 54.792 94.58 116.831 141.874C21.15 427.157 157.279 430.346 262.34 432.808c9.754.228 19.24.451 28.44.752 54.11 1.77 98.469 6.261 129.113 30.962 30.679 24.731 47.478 69.593 46.845 151.712l-1.053-.008c.632-82.025-16.159-126.464-46.453-150.884-30.329-24.448-74.326-28.958-128.486-30.73-9.197-.301-18.682-.523-28.438-.751-105.071-2.459-241.515-5.653-386.269-116.002-62.151-47.378-98.833-95.292-117.174-142.329-18.343-47.042-18.323-93.164-7.14-136.926Zm88.481-211.63c-54.101 57.277-121.087 135.36-143.444 222.848-11.183 43.762-11.203 89.884 7.14 136.926 18.341 47.037 55.023 94.95 117.174 142.329C-34.17 439.426 102.274 442.62 207.345 445.079c9.756.228 19.241.45 28.438.751 54.16 1.772 98.157 6.281 128.486 30.73 30.294 24.42 47.085 68.859 46.453 150.884l1.053.008c.633-82.119-16.166-126.981-46.845-151.712-30.644-24.702-75.003-29.192-129.113-30.962-9.2-.301-18.686-.524-28.44-.752-105.061-2.462-241.19-5.651-385.663-115.786-62.039-47.294-98.578-95.062-116.831-141.875-18.252-46.807-18.238-92.701-7.101-136.282 22.282-87.197 89.083-165.103 143.189-222.386l-.765-.723ZM-357.871 61.76c22.357-87.489 89.343-165.571 143.444-222.848l.765.723c-54.106 57.282-120.906 135.189-143.189 222.386-11.137 43.58-11.15 89.475 7.101 136.282 18.254 46.813 54.793 94.581 116.832 141.874C-88.445 450.312 47.683 453.502 152.744 455.963c9.754.229 19.24.451 28.441.752 54.109 1.77 98.469 6.261 129.112 30.963 30.68 24.731 47.478 69.593 46.846 151.712l-1.053-.009c.631-82.025-16.16-126.463-46.454-150.883-30.329-24.449-74.326-28.959-128.486-30.73-9.196-.301-18.682-.523-28.438-.752-105.07-2.459-241.515-5.652-386.269-116.001-62.15-47.379-98.833-95.293-117.174-142.329-18.343-47.042-18.323-93.165-7.14-136.926Zm89.504-209.469c-54.101 57.277-121.086 135.36-143.444 222.848-11.183 43.762-11.202 89.884 7.141 136.926 18.34 47.037 55.023 94.95 117.174 142.329C-142.743 464.743-6.298 467.937 98.772 470.396c9.757.228 19.242.45 28.439.751 54.16 1.772 98.156 6.281 128.486 30.73 30.293 24.42 47.085 68.859 46.453 150.884l1.053.008c.632-82.119-16.166-126.981-46.845-151.712-30.644-24.702-75.004-29.192-129.113-30.962-9.2-.301-18.687-.524-28.44-.752-105.061-2.462-241.19-5.651-385.663-115.786-62.039-47.294-98.578-95.062-116.831-141.875-18.252-46.807-18.238-92.701-7.101-136.282 22.282-87.197 89.083-165.103 143.189-222.386l-.766-.723Zm-196.429 238.17c22.357-87.49 89.343-165.571 143.444-222.848l.765.723C-374.693-74.382-441.494 3.525-463.776 90.721c-11.137 43.581-11.151 89.475 7.101 136.283 18.253 46.812 54.792 94.58 116.831 141.874C-195.371 479.013-59.242 482.203 45.819 484.664c9.754.229 19.24.451 28.44.752 54.11 1.77 98.469 6.261 129.113 30.963 30.679 24.73 47.478 69.593 46.845 151.711l-1.053-.008c.632-82.025-16.159-126.464-46.453-150.883-30.329-24.449-74.326-28.959-128.486-30.731-9.197-.301-18.682-.523-28.438-.751-105.071-2.459-241.515-5.652-386.269-116.001-62.151-47.379-98.833-95.293-117.174-142.33-18.343-47.041-18.323-93.164-7.14-136.925Zm91.599-205.252c-54.101 57.277-121.087 135.36-143.444 222.848-11.183 43.762-11.202 89.884 7.14 136.926 18.341 47.037 55.024 94.95 117.175 142.329C-247.573 497.661-111.129 500.854-6.058 503.314c9.756.228 19.242.45 28.439.751 54.16 1.772 98.156 6.281 128.486 30.73 30.293 24.42 47.085 68.859 46.453 150.884l1.053.008c.632-82.119-16.166-126.981-46.846-151.712-30.643-24.702-75.003-29.192-129.112-30.963-9.2-.301-18.687-.523-28.44-.751-105.061-2.462-241.19-5.651-385.663-115.786-62.039-47.294-98.578-95.062-116.832-141.875-18.251-46.807-18.237-92.701-7.101-136.282 22.283-87.197 89.084-165.103 143.19-222.386l-.766-.723Z"
          clip-rule="evenodd"
        ></path>
        <defs>
          <radialGradient
            id="pattern_svg__a"
            cx="0"
            cy="0"
            r="1"
            gradientTransform="rotate(37.829 -169.861 190.972) scale(795.184 813.312)"
            gradientUnits="userSpaceOnUse"
          >
            <stop stop-color="#363853" stop-opacity="0.2"></stop>
            <stop offset="1" stop-color="#1E1E1E" stop-opacity="0"></stop>
            <stop offset="1" stop-color="#0E0E35" stop-opacity="0"></stop>
            <stop offset="1" stop-color="#363853"></stop>
          </radialGradient>
        </defs>
      </svg>

      <section className="container md:max-w-screen-lg mx-auto mt-12 md:mt-16">
        <div className="flex gap-y-9 flex-col-reverse items-center md:flex-row md:gap-x-5 md:items-center md:justify-between">
          <div className="text-center md:text-right">
            <div className="flex gap-2 mb-4 md:mb-4 md:text-base text-xs">
              <div className="flex items-center gap-1 bg-[#4d70ff] hover:bg-[#3f61ec] cursor-pointer text-white rounded-xl text-sm px-1 py-[1px] font-light">
                <svg
                  stroke="currentColor"
                  fill="none"
                  stroke-width="2"
                  viewBox="0 0 24 24"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                  class="MuiChip-icon MuiChip-iconSmall MuiChip-iconColorPrimary w-4 h-4"
                  height="1em"
                  width="1em"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <desc></desc>
                  <path stroke="none" d="M0 0h24v24H0z" fill="none"></path>
                  <line x1="9" y1="15" x2="15" y2="9"></line>
                  <circle cx="9.5" cy="9.5" r=".5" fill="currentColor"></circle>
                  <circle
                    cx="14.5"
                    cy="14.5"
                    r=".5"
                    fill="currentColor"
                  ></circle>
                  <circle cx="12" cy="12" r="9"></circle>
                </svg>
                <span>جشنواره تخفیف</span>
              </div>
              <span className="text-sm font-extralight text-blue-500">
                به زودی!
              </span>
            </div>

            <h1 className="mb-2 md:mb-5 text-2xl font-[900] md:text-[40px] sm:text-[30px] lg:text-[50px] leading-relaxed text-[#2a2d53]">
              برنامه‌نویسی را سریع <br />و آسان یاد بگیرید
            </h1>

            <p className="text-gray-400 font-medium md:text-lg mb-6 md:mb-2 text-xs">
              ما کنارتون هستیم تا عمیق یاد بگیرید،
              <br />و با بهترین مسیر ممکن به مقصدتون برسید.
            </p>

            <div className="max-w-screen-sm h-0.5 bg-[#BEC1F333] mb-4 md:mb-7"></div>

            <div className="flex items-center md:gap-x-4">
              <a href="/">
                <button className="text-white bg-[#4d70ff] px-9 rounded-full text-lg md:px-9 md:py-4 py-2.5 shadow-[0px_4px_44px_0px_#4A6DFF66] hover:bg-[#4368fd] transition-all ease-in">
                  بزن بریم!
                </button>
              </a>

              <div className="flex-col">
                <div className="flex flex-row-reverse">
                  <div className="mr-[-8px] relative md:h-9 box-content md:w-9 w-7 h-7 border-2 rounded-full border-gray-200 overflow-hidden">
                    <img
                      className="absolute top-0 bottom-0 left-0 right-0 w-full h-full object-cover"
                      src="./images/user1.webp"
                      alt="user"
                    />
                  </div>
                  <div className="mr-[-8px] relative md:h-9 box-content md:w-9 w-7 h-7 border-2 rounded-full border-gray-200 overflow-hidden">
                    <img
                      className="absolute top-0 bottom-0 left-0 right-0 w-full h-full object-cover"
                      src="./images/user2.webp"
                      alt="user"
                    />
                  </div>
                  <div className="mr-[-8px] relative md:h-9 box-content md:w-9 w-7 h-7 border-2 rounded-full border-gray-200 overflow-hidden">
                    <img
                      className="absolute top-0 bottom-0 left-0 right-0 w-full h-full object-cover"
                      src="./images/user3.webp"
                      alt="user"
                    />
                  </div>
                  <div className="relative md:h-9 box-content md:w-9 w-7 h-7 border-2 rounded-full border-gray-200 overflow-hidden">
                    <img
                      className="absolute top-0 bottom-0 left-0 right-0 w-full h-full object-cover"
                      src="./images/saheb.webp"
                      alt="user"
                    />
                  </div>
                </div>

                <p className="flex items-center mt-1">
                  <svg
                    viewBox="0 0 15 15"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                    class="h-3 w-3 text-[#4d70ff]"
                  >
                    <path
                      d="M7.5 1.875c-1.521 0-2.755 1.223-2.755 2.732 0 1.51 1.234 2.732 2.755 2.732s2.755-1.223 2.755-2.732c0-1.509-1.234-2.732-2.755-2.732ZM9.126 8.555a10.398 10.398 0 0 0-3.252 0l-.115.018a3.109 3.109 0 0 0-2.634 3.063c0 .822.672 1.489 1.502 1.489h5.746c.83 0 1.502-.667 1.502-1.49a3.109 3.109 0 0 0-2.634-3.062l-.115-.018Z"
                      fill="currentColor"
                    ></path>
                  </svg>
                  <span className="text-[#4d70ff] text-sm mx-0.5 font-bold md:text-sm">
                    ۷.۵
                  </span>
                  <span className="text-xs text-[#3f4264]">هزار دانشجو</span>
                </p>
              </div>
            </div>

            <div class="flex justify-end ">
              <svg
                viewBox="0 0 39 104"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
                class="md:w-6 hidden md:block text-[#261957]"
              >
                <path
                  d="M9.96 92.03c3.946 3.092 9.307 7.14 13.43 9.493m0 0c.474.271.204-3.913.177-4.109-.581-4.301-1.625-8.535-2.764-12.848m2.586 16.957C4.44 80.457-2.175 53.037 5.481 38.907c.758-1.4 1.586-2.924 2.55-4.313m0 0c1.537-2.213 3.422-4.087 5.935-4.59 2.318-.463 5.784.17 7.94 2.607 4.027 4.553 2.166 11.094-2.429 11.22-4.037.112-9.76-4.42-11.445-9.237Zm0 0a9.684 9.684 0 0 1-.1-.305C.23 9.709 19.54-1.921 36.868 3.657"
                  stroke="currentColor"
                  stroke-width="3"
                  stroke-miterlimit="1.5"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
              </svg>
            </div>
          </div>

          <div className="w-[80%] md:w-[45%] max-w-screen-sm relative">
            <div className="mb-4">
              <img src="./images/banner.webp" alt="" />
            </div>
            <div
              class="absolute -bottom-0 w-full h-48 z-2"
              style={{
                background:
                  "linear-gradient(180deg, rgba(255, 255, 255, 0) 37%, #F4F5F7 93%)",
              }}
            ></div>
          </div>
        </div>
      </section>

      <section className="my-16 sm:my-28 grid grid-cols-10 gap-4 md:gap-8 container pr-4 pl-4 mr-auto ml-auto md:max-w-screen-xl">
        <Introduction
          isHover={true}
          title="کاربردی و پروژه‌محور"
          hover="با کار روی پروژه‌های واقعی، بازار رو از نزدیک لمس کنید"
        >
          <svg
            viewBox="0 0 74 74"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
            class="w-full h-full top-0 left-0 absolute z-1 "
          >
            <path
              d="M73.302 36.65c0 24.435-12.217 36.652-36.651 36.652C12.217 73.302 0 61.085 0 36.65 0 12.217 12.217 0 36.65 0c24.435 0 36.652 12.217 36.652 36.65Z"
              fill="url(#warranty-holder_svg__a)"
            ></path>
            <defs>
              <linearGradient
                id="warranty-holder_svg__a"
                x1="0.099"
                y1="0"
                x2="73.212"
                y2="73.413"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#7EB5F9"></stop>
                <stop offset="1" stop-color="#6475FF"></stop>
              </linearGradient>
            </defs>
          </svg>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 24 24"
            fill="none"
            class="h-9 w-9 z-10 text-white shadow-warranty-icon-mini md:shadow-warranty-icon"
          >
            <path
              stroke="currentColor"
              stroke-width="1.5"
              d="M3.353 8.95A7.511 7.511 0 0 1 8.95 3.353c2.006-.47 4.094-.47 6.1 0a7.511 7.511 0 0 1 5.597 5.597c.47 2.006.47 4.094 0 6.1a7.511 7.511 0 0 1-5.597 5.597c-2.006.47-4.094.47-6.1 0a7.511 7.511 0 0 1-5.597-5.597 13.354 13.354 0 0 1 0-6.1Z"
            ></path>
            <path
              stroke="currentColor"
              stroke-linecap="round"
              stroke-linejoin="round"
              stroke-width="1.5"
              d="m8 9.5 2.078 1.732a1 1 0 0 1 0 1.536L8 14.5"
            ></path>
            <path
              stroke="currentColor"
              stroke-linecap="round"
              stroke-width="1.5"
              d="M12.5 14.5H16"
            ></path>
          </svg>
        </Introduction>
        <Introduction
          isHover={true}
          title="ویدئوهای کوتاه و باکیفیت"
          hover="هر مبحث در قالب یک جلسه کوتاه و کاربردی آماده شده است"
        >
          <svg
            viewBox="0 0 74 74"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
            class="w-full h-full top-0 left-0 absolute z-1 "
          >
            <path
              d="M73.302 36.65c0 24.435-12.217 36.652-36.651 36.652C12.217 73.302 0 61.085 0 36.65 0 12.217 12.217 0 36.65 0c24.435 0 36.652 12.217 36.652 36.65Z"
              fill="url(#warranty-holder_svg__a)"
            ></path>
            <defs>
              <linearGradient
                id="warranty-holder_svg__a"
                x1="0.099"
                y1="0"
                x2="73.212"
                y2="73.413"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#7EB5F9"></stop>
                <stop offset="1" stop-color="#6475FF"></stop>
              </linearGradient>
            </defs>
          </svg>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 24 24"
            fill="none"
            class="h-9 w-9 z-10 text-white shadow-warranty-icon-mini md:shadow-warranty-icon"
          >
            <path
              stroke="currentColor"
              stroke-width="1.5"
              d="M3.353 8.95A7.511 7.511 0 0 1 8.95 3.353c2.006-.47 4.094-.47 6.1 0a7.511 7.511 0 0 1 5.597 5.597c.47 2.006.47 4.094 0 6.1a7.511 7.511 0 0 1-5.597 5.597c-2.006.47-4.094.47-6.1 0a7.511 7.511 0 0 1-5.597-5.597 13.354 13.354 0 0 1 0-6.1Z"
            ></path>
            <path
              stroke="currentColor"
              stroke-linecap="round"
              stroke-linejoin="round"
              stroke-width="1.5"
              d="m14.5 14.5-2.839-1.806V9"
            ></path>
          </svg>
        </Introduction>
        <Introduction
          isHover={true}
          title="همراهی مربی"
          hover="با مربی‌های حرفه‌ای و با حوصله رفع اشکال می‌کنید"
        >
          <svg
            viewBox="0 0 74 74"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
            class="w-full h-full top-0 left-0 absolute z-1 "
          >
            <path
              d="M73.302 36.65c0 24.435-12.217 36.652-36.651 36.652C12.217 73.302 0 61.085 0 36.65 0 12.217 12.217 0 36.65 0c24.435 0 36.652 12.217 36.652 36.65Z"
              fill="url(#warranty-holder_svg__a)"
            ></path>
            <defs>
              <linearGradient
                id="warranty-holder_svg__a"
                x1="0.099"
                y1="0"
                x2="73.212"
                y2="73.413"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#7EB5F9"></stop>
                <stop offset="1" stop-color="#6475FF"></stop>
              </linearGradient>
            </defs>
          </svg>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 24 24"
            fill="none"
            class="h-8 w-8 z-10 text-white shadow-warranty-icon-mini md:shadow-warranty-icon"
          >
            <path
              stroke="currentColor"
              stroke-width="1.5"
              d="M3 19.111c0-2.413 1.697-4.468 4.004-4.848l.208-.035a17.134 17.134 0 0 1 5.576 0l.208.035c2.307.38 4.004 2.435 4.004 4.848C17 20.154 16.181 21 15.172 21H4.828C3.818 21 3 20.154 3 19.111ZM14.083 6.938c0 2.174-1.828 3.937-4.083 3.937S5.917 9.112 5.917 6.937C5.917 4.764 7.745 3 10 3s4.083 1.763 4.083 3.938Z"
            ></path>
            <g clip-path="url(#coach_svg__a)">
              <path
                stroke="currentColor"
                stroke-linecap="round"
                stroke-linejoin="round"
                d="M18.218 8.529a.843.843 0 0 1 1.564 0l.204.49c.12.29.383.49.688.524l.57.065c.718.081 1.015.984.49 1.492l-.483.467a.879.879 0 0 0-.249.801l.117.59c.148.748-.653 1.312-1.285.906l-.382-.245a.834.834 0 0 0-.904 0l-.382.245c-.632.406-1.433-.158-1.285-.905l.117-.59a.879.879 0 0 0-.249-.802l-.483-.467c-.524-.508-.228-1.41.49-1.492l.57-.065a.852.852 0 0 0 .688-.523l.204-.491Z"
              ></path>
            </g>
            <defs>
              <clipPath id="coach_svg__a">
                <path fill="#fff" d="M15 7h8v8h-8z"></path>
              </clipPath>
            </defs>
          </svg>
        </Introduction>
        <Introduction
          isHover={true}
          title="تضمین کیفیت"
          hover="بهترین پشتیبانی و به روز ترین سطح آموزش موجود در سطح جهانی رو دریافت می‌کنید"
        >
          <svg
            viewBox="0 0 74 74"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
            class="w-full h-full top-0 left-0 absolute z-1 "
          >
            <path
              d="M73.302 36.65c0 24.435-12.217 36.652-36.651 36.652C12.217 73.302 0 61.085 0 36.65 0 12.217 12.217 0 36.65 0c24.435 0 36.652 12.217 36.652 36.65Z"
              fill="url(#warranty-holder_svg__a)"
            ></path>
            <defs>
              <linearGradient
                id="warranty-holder_svg__a"
                x1="0.099"
                y1="0"
                x2="73.212"
                y2="73.413"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#7EB5F9"></stop>
                <stop offset="1" stop-color="#6475FF"></stop>
              </linearGradient>
            </defs>
          </svg>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 24 24"
            fill="none"
            class="h-9 w-9 z-10 text-white shadow-warranty-icon-mini md:shadow-warranty-icon"
          >
            <path
              stroke="currentColor"
              stroke-width="1.5"
              d="m15.875 19.487.18-.124c.566-.391.849-.587 1.101-.796a7.495 7.495 0 0 0 2.603-4.476c.056-.323.086-.664.144-1.346l.03-.353A17.996 17.996 0 0 0 19.906 9l-.036-.349a5.75 5.75 0 0 0-3.205-4.574 10.642 10.642 0 0 0-9.328 0A5.75 5.75 0 0 0 4.13 8.65L4.094 9a17.993 17.993 0 0 0-.029 3.391l.03.353c.06.682.089 1.023.145 1.346a7.495 7.495 0 0 0 2.603 4.476c.253.21.535.405 1.1.796l.18.124c.769.532 1.153.797 1.538.982a5.41 5.41 0 0 0 4.676 0c.385-.185.77-.45 1.537-.982Z"
            ></path>
            <path
              stroke="currentColor"
              stroke-linecap="round"
              stroke-linejoin="round"
              stroke-width="1.5"
              d="m9.25 11.75 2 2 3.5-3.75"
            ></path>
          </svg>
        </Introduction>
        <Introduction
          isHover={true}
          title="تضمین بازگشت کیفیت"
          hover="اگه راضی نبودید تا ۱۵ روز فرصت دارید انصراف بدید"
        >
          <svg
            viewBox="0 0 74 74"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
            class="w-full h-full top-0 left-0 absolute z-1 "
          >
            <path
              d="M73.302 36.65c0 24.435-12.217 36.652-36.651 36.652C12.217 73.302 0 61.085 0 36.65 0 12.217 12.217 0 36.65 0c24.435 0 36.652 12.217 36.652 36.65Z"
              fill="url(#warranty-holder_svg__a)"
            ></path>
            <defs>
              <linearGradient
                id="warranty-holder_svg__a"
                x1="0.099"
                y1="0"
                x2="73.212"
                y2="73.413"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#7EB5F9"></stop>
                <stop offset="1" stop-color="#6475FF"></stop>
              </linearGradient>
            </defs>
          </svg>
          <svg
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 24 24"
            fill="none"
            class="h-9 w-9 z-10 text-white shadow-warranty-icon-mini md:shadow-warranty-icon"
          >
            <path
              stroke="currentColor"
              stroke-width="1.5"
              d="M2.885 8.849a7.353 7.353 0 0 1 5.546-5.407l.453-.101a14.401 14.401 0 0 1 6.232 0l.453.1a7.353 7.353 0 0 1 5.546 5.408 13.07 13.07 0 0 1 0 6.302 7.353 7.353 0 0 1-5.546 5.407l-.453.101a14.402 14.402 0 0 1-6.232 0l-.453-.1a7.353 7.353 0 0 1-5.546-5.408 13.077 13.077 0 0 1 0-6.302Z"
            ></path>
            <path
              fill="currentColor"
              fill-rule="evenodd"
              d="M12 7c.383 0 .693.292.693.652v.534h.076C14.057 8.186 15 9.24 15 10.419c0 .36-.31.652-.692.652-.383 0-.693-.292-.693-.652 0-.568-.434-.929-.846-.929h-.076v2.053l.934.32a2.03 2.03 0 0 1-.66 3.95h-.274v.535c0 .36-.31.652-.693.652-.382 0-.692-.292-.692-.652v-.534h-.077C9.943 15.814 9 14.76 9 13.581c0-.36.31-.652.692-.652.383 0 .693.292.693.652 0 .568.434.929.846.929h.077v-2.053l-.935-.32a2.03 2.03 0 0 1 .66-3.95h.275V7.65c0-.36.31-.652.692-.652Zm-.692 2.49h-.275c-.302 0-.648.27-.648.726 0 .349.215.61.46.695l.463.158V9.49Zm1.385 3.441v1.579h.274c.302 0 .648-.27.648-.726a.724.724 0 0 0-.46-.695l-.462-.158Z"
              clip-rule="evenodd"
            ></path>
          </svg>
        </Introduction>
      </section>

      {/* The latest courses */}
      <section className="md:flex md:justify-center">
        <div className="md:container px-5 md:max-w-screen-xl newest_container">
          <div className=" max-h-[800px] rounded-xl pb-3 md:p-8 flex md:flex-row flex-col md:h-[500px]">
            {/* title */}
            <div className="md:h-full my-4 mb-8 md:mb-0 items-center md:items-start md:self-start flex flex-col-reverse relative md:pl-14">
              <div className="flex flex-col justify-end items-start h-1/2 ">
                <div className="text-secondary-800 ">
                  <h1 className="text-3xl font-extrabold">جدیدترین دوره‌ها</h1>
                  <div className="newst_image absolute bottom-[19%] hidden lg:block lg:h-44 lg:w-44">
                    <img
                      className="h-full"
                      src="./images/code.svg"
                      alt="courses"
                    />
                  </div>
                </div>
                <p class="text-sm my-5 opacity-80">
                  دوره ببین، تمرین کن و برنامه نویس شو
                </p>
                <div className="flex justify-center md:justify-start w-full">
                  <a href="##">
                    <button className="shadow-[0_13px_22px_-6px_rgba(183,197,255,1)] rounded-2xl py-3 px-8 bg-blue-600 hover:bg-blue-500 transition-all duration-200 ease-in text-white">
                      همه دوره‌ها
                    </button>
                  </a>
                </div>
              </div>
            </div>

            {/* Slider */}
            <div className="slider flex overflow-x-hidden rounded-lg overflow-hidden flex-1">
              <Slider />
            </div>
          </div>
        </div>
      </section>

      {/* students' comments */}
      <section className="py-16">
        <Introduce title={comments_title} sec="cmnt" data={comments} />
      </section>

      {/* video */}
      <div
        className={`${
          vid ? "block" : "hidden"
        } z-50 flex justify-center fixed w-[100vw] h-[100vh] bg-[rgba(0,0,0,0.4)] top-0 left-0 bottom-0 right-0`}
      >
        <div className="max-w-3xl max-h-96 rounded-2xl border-2 border-white overflow-hidden mt-28">
          <video
            className="max-w-full max-h-full"
            ref={videoRef}
            src="./videos/آموزش تخصصی برنامه نویسی وب - فرانت اند - فرانت هوکس.mp4"
            controls
          ></video>
        </div>
      </div>

      {/* Employment of students */}
      <section className="py-16">
        <Introduce
          title={employment_title}
          sec="emply"
          slide={1}
          data={employment}
          setVid={setVid}
          setVidSrc={setVidSrc}
        />
      </section>

      {/* Challenges */}
      <section className="py-16">
        <Introduce
          title={Challenges_title}
          sec="chlg"
          slide={1}
          data={employment}
          setVid={setVid}
          setVidSrc={setVidSrc}
        />
      </section>

      {/* History */}
      <section className="py-16">
        <Introduce
          title={history_title}
          sec="hstry"
          slide={1}
          data={employment}
          setVid={setVid}
          setVidSrc={setVidSrc}
        />
      </section>

      {/* Road map */}
      <section className="py-16">
        <div>
          <div className="container mx-auto md:max-w-screen-lg">
            {/* up */}
            <div className="flex flex-col items-center justify-center">
              <h1 className="font-extrabold text-lg md:text-3xl">
                مسیر یادگیری فرانت اند
              </h1>
              <h2 className="text-sm md:text-lg pt-1">
                نقشه راه و مسیر یادگیری فرانت اند
              </h2>
            </div>

            {/* down */}
            <div className="mt-10 flex snap-x px-4 pb-5 justify-between gap-x-16 md:gap-x-0 overflow-x-auto md:overflow-visible sm:overflow-x-auto sm:overflow-y-hidden">
              <div className="relative">
                <RoadMapComp info="HTML CSS">
                  <svg
                    stroke="currentColor"
                    fill="currentColor"
                    stroke-width="0"
                    role="img"
                    viewBox="0 0 24 24"
                    class="h-9 w-9 md:w-10 md:h-10 z-10"
                    height="1em"
                    width="1em"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <title></title>
                    <path d="M1.5 0h21l-1.91 21.563L11.977 24l-8.564-2.438L1.5 0zm7.031 9.75l-.232-2.718 10.059.003.23-2.622L5.412 4.41l.698 8.01h9.126l-.326 3.426-2.91.804-2.955-.81-.188-2.11H6.248l.33 4.171L12 19.351l5.379-1.443.744-8.157H8.531z"></path>
                  </svg>
                </RoadMapComp>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 105 95"
                  fill="none"
                  class="absolute -left-10 -bottom-2 w-12 md:w-16 md:-left-16"
                >
                  <path
                    stroke="#D4D5DD"
                    stroke-linecap="round"
                    stroke-linejoin="round"
                    stroke-miterlimit="1.5"
                    stroke-width="3.015"
                    d="M2.427 23.897C2.22 19.63 2.081 13.84 2.681 9.44m0 0c.068-.507 3.777.052 3.942.092 3.608.887 6.84 2.244 10.083 3.705M2.68 9.44c6.778 20.914 27.81 29.559 46.134 22.626 1.816-.687 3.793-1.437 5.738-2.337m0 0c3.098-1.433 6.117-3.248 8.284-5.8 2-2.355 3.754-5.965 2.946-8.347-1.511-4.45-8.856-2.972-12.081 1.748-2.835 4.148-2.49 10.342.85 12.399Zm0 0c.07.043.142.085.215.125C72.425 39.425 96.306 20.33 102.84 2.12"
                  ></path>
                  <path
                    fill="#D4D5DD"
                    d="M34.783 70.478h.421c.426 0 .638 1.735.638 5.207 0 .721.023 1.709.069 2.962h-.069l.069.137v1.413c0 2.909-.775 5.093-2.325 6.551-1.77 1.55-3.51 2.325-5.218 2.325h-1.265c-1.64 0-3.145-.612-4.512-1.835-.38-.425-.684-1.01-.912-1.754v-1.06c0-1.42.988-2.925 2.963-4.512 2.12-1.405 3.95-2.108 5.492-2.108h.421c.092.015.137.06.137.137-1.268.326-2.864 1.124-4.785 2.392-1.831 1.512-2.746 2.78-2.746 3.806v.57c.09.562.35 1.056.774 1.481.996.798 2.146 1.196 3.453 1.196 0 .046.118.069.353.069 2.09 0 3.897-.87 5.424-2.61.752-1.048 1.128-2.08 1.128-3.099-.046-5.302-.069-8.682-.069-10.14 0-.494.187-.87.559-1.128Zm4.238 8.636h.479c.448 0 .843.494 1.185 1.481v.832c0 .684-.813 1.614-2.438 2.792-1.907 1.291-3.548 2.043-4.923 2.256h-.296c-1.071-.205-1.607-.562-1.607-1.071a.442.442 0 0 1 .183-.057l.592.182h.297c1.412-.167 3.152-.919 5.218-2.256.98-.775 1.515-1.272 1.607-1.492v-.058h-.057c-.1 0-.259.02-.479.058-.592 0-.95-.377-1.071-1.129v-.056c.22-.988.657-1.482 1.31-1.482Zm-.239 1.071-.057.297a.46.46 0 0 1 .057.228h.718c.076 0 .114-.038.114-.114 0-.107-.137-.244-.41-.41h-.422Zm5.082-2.86c.334 0 .501.54.501 1.618 0 2.743-.562 4.418-1.686 5.025-.205.312-.934.786-2.188 1.424h-.33v-.125c2.02-1.284 3.03-2.75 3.03-4.398v-2.985c0-.373.225-.559.673-.559Zm12.704-2.381c.828 0 1.785.338 2.872 1.014v.388c0 .25-1.166.406-3.498.467-1.094.288-1.953.885-2.575 1.788-.775 1.535-1.163 2.728-1.163 3.578-.16.562-.68 3.472-1.56 8.728-.517 2.31-.878 3.502-1.083 3.578h-.16c-.311-.16-.467-.498-.467-1.014 1.352-7.733 2.184-12.169 2.496-13.309.653-1.853 1.587-3.099 2.803-3.737a6.846 6.846 0 0 1 2.176-.706c0-.198.053-.456.16-.775Zm3.76 5.47a8.67 8.67 0 0 1 1.106-2.109c.531-.729.934-1.094 1.208-1.094.197 0 .296.1.296.297 0 .098-.186.467-.559 1.105-.227.38-.421.767-.58 1.162a7.82 7.82 0 0 0-.365 1.22c-.03.174-.057.334-.08.478a2.843 2.843 0 0 0-.034.444c-.008.236.03.445.114.627.09.175.212.315.364.422.16.106.342.19.547.25.213.053.437.08.672.08v1.595c-1.184.091-2.04-.27-2.563-1.082-.297-.426-.445-.965-.445-1.618 0-.259.023-.536.069-.832.053-.304.136-.62.25-.946Zm38.467-35.026h.217c.144 0 .216.106.216.319-.85 1.344-2.434 2.894-4.751 4.648-8.994 7.407-16.161 13.24-21.501 17.502-3.82 3.099-6.628 4.649-8.42 4.649-1.01-.091-1.516-.452-1.516-1.083.456-1.633 2.868-3.828 7.236-6.586 1.534-1.01 2.506-1.515 2.916-1.515l.114.216c-.114.183-2.457 2.055-7.03 5.618-1.002.866-1.504 1.44-1.504 1.72h.103c1.93 0 7.619-4.102 17.068-12.305 6.86-5.69 12.01-9.834 15.45-12.431.266-.19.734-.441 1.402-.752Zm-33.51 30.958c.501.136.752.383.752.74 0 .555.034 1.553.102 2.997 0 3.205-1.033 4.808-3.099 4.808-.099 0-.205-.106-.319-.319v-1.071c0-.152.32-.292.957-.422.57-.486.855-1.378.855-2.677v-3.1c0-.463.25-.782.752-.957Z"
                  ></path>
                </svg>
              </div>

              <div className="relative">
                <RoadMapComp info="جاوااسکریپت">
                  <svg
                    stroke="currentColor"
                    fill="currentColor"
                    stroke-width="0"
                    role="img"
                    viewBox="0 0 24 24"
                    class="h-9 w-9 md:w-10 md:h-10 z-10"
                    height="1em"
                    width="1em"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <title></title>
                    <path d="M0 0h24v24H0V0zm22.034 18.276c-.175-1.095-.888-2.015-3.003-2.873-.736-.345-1.554-.585-1.797-1.14-.091-.33-.105-.51-.046-.705.15-.646.915-.84 1.515-.66.39.12.75.42.976.9 1.034-.676 1.034-.676 1.755-1.125-.27-.42-.404-.601-.586-.78-.63-.705-1.469-1.065-2.834-1.034l-.705.089c-.676.165-1.32.525-1.71 1.005-1.14 1.291-.811 3.541.569 4.471 1.365 1.02 3.361 1.244 3.616 2.205.24 1.17-.87 1.545-1.966 1.41-.811-.18-1.26-.586-1.755-1.336l-1.83 1.051c.21.48.45.689.81 1.109 1.74 1.756 6.09 1.666 6.871-1.004.029-.09.24-.705.074-1.65l.046.067zm-8.983-7.245h-2.248c0 1.938-.009 3.864-.009 5.805 0 1.232.063 2.363-.138 2.711-.33.689-1.18.601-1.566.48-.396-.196-.597-.466-.83-.855-.063-.105-.11-.196-.127-.196l-1.825 1.125c.305.63.75 1.172 1.324 1.517.855.51 2.004.675 3.207.405.783-.226 1.458-.691 1.811-1.411.51-.93.402-2.07.397-3.346.012-2.054 0-4.109 0-6.179l.004-.056z"></path>
                  </svg>
                </RoadMapComp>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 113 129"
                  fill="none"
                  class="absolute -left-12 -top-6 md:-top-10 w-12 z-10 md:w-16 md:-left-20"
                >
                  <path
                    stroke="#D4D5DD"
                    stroke-linecap="round"
                    stroke-linejoin="round"
                    stroke-miterlimit="1.5"
                    stroke-width="3.015"
                    d="M3.24 112.729c-.543 4.258-1.144 10.022-.924 14.345m0 0c.026.498 3.633-.36 3.794-.413 3.537-1.175 6.751-2.788 9.983-4.504m-13.777 4.917c8.198-21.334 41.87-51.673 58.909-46.278 1.688.535 3.526 1.119 5.321 1.855m0 0c2.86 1.171 5.613 2.728 7.488 5.088 1.73 2.177 3.125 5.62 2.156 8.053-1.81 4.544-8.745 3.675-11.462-.752-2.387-3.89-1.557-10.073 1.819-12.39Zm0 0a5.41 5.41 0 0 1 .217-.142c17.73-10.95 39.125 6.077 43.929 23.638"
                  ></path>
                  <path
                    fill="#D4D5DD"
                    d="M41.618 30.488c.828 0 1.785.338 2.872 1.014v.387c0 .25-1.166.407-3.498.467-1.094.289-1.953.885-2.575 1.79-.775 1.534-1.163 2.726-1.163 3.577-.16.562-.68 3.471-1.56 8.728-.517 2.31-.878 3.502-1.083 3.578h-.16c-.311-.16-.467-.498-.467-1.014 1.352-7.733 2.184-12.17 2.495-13.309.654-1.853 1.588-3.099 2.803-3.737a6.845 6.845 0 0 1 2.177-.707c0-.197.053-.455.16-.774Zm5.014 4.17h.478c.448 0 .843.494 1.185 1.481v.832c0 .684-.813 1.614-2.438 2.792-1.907 1.29-3.547 2.043-4.922 2.256h-.297c-1.07-.206-1.606-.563-1.606-1.071a.44.44 0 0 1 .182-.057l.593.182h.296c1.413-.167 3.152-.92 5.218-2.256.98-.775 1.516-1.273 1.607-1.493v-.057h-.057c-.099 0-.258.02-.479.057-.592 0-.95-.376-1.07-1.128v-.057c.22-.987.656-1.481 1.31-1.481Zm-.24 1.071-.057.296a.46.46 0 0 1 .057.228h.718c.076 0 .114-.038.114-.114 0-.106-.136-.243-.41-.41h-.422Zm5.652-1.299h.148c.25 0 .536.372.855 1.117.098.28.148.467.148.558v.627c-.069.554-.365 1.112-.889 1.675-.448.425-1.238.854-2.37 1.287-.744.312-1.933.608-3.566.889-.243.053-.464.08-.661.08h-.183c-.053 0-.08-.027-.08-.08v-.068c.077 0 .905-.285 2.485-.855 1.625-.608 2.727-1.177 3.304-1.71.54-.455.809-1.059.809-1.81 0-.282-.11-.605-.33-.97v-.512c.083-.152.193-.228.33-.228Zm13.776-3.942c.827 0 1.785.338 2.87 1.014v.387c0 .25-1.165.407-3.497.467-1.094.289-1.952.885-2.575 1.79-.775 1.534-1.163 2.726-1.163 3.577-.159.562-.68 3.471-1.56 8.728-.517 2.31-.878 3.502-1.083 3.578h-.16c-.31-.16-.467-.498-.467-1.014 1.352-7.733 2.184-12.17 2.496-13.309.653-1.853 1.587-3.099 2.803-3.737a6.846 6.846 0 0 1 2.176-.707c0-.197.053-.455.16-.774Zm3.76 5.469a8.67 8.67 0 0 1 1.105-2.108c.531-.73.934-1.094 1.208-1.094.197 0 .296.099.296.296 0 .1-.186.468-.558 1.106a8.35 8.35 0 0 0-.582 1.162 7.82 7.82 0 0 0-.364 1.219c-.03.175-.057.334-.08.479a2.843 2.843 0 0 0-.034.444c-.008.235.03.444.114.627.09.174.212.315.364.421.16.106.342.19.547.25.213.054.437.08.673.08v1.596c-1.185.091-2.04-.27-2.564-1.083-.296-.425-.445-.964-.445-1.618 0-.258.023-.535.069-.831.053-.304.137-.62.25-.946ZM108.046.93h.217c.144 0 .216.107.216.32-.851 1.344-2.434 2.893-4.751 4.648-8.994 7.406-16.16 13.24-21.5 17.502-3.822 3.099-6.628 4.648-8.421 4.648-1.01-.09-1.516-.452-1.516-1.082.456-1.633 2.868-3.828 7.236-6.586 1.534-1.01 2.506-1.515 2.917-1.515l.114.216c-.114.183-2.458 2.055-7.03 5.617-1.003.866-1.505 1.44-1.505 1.721h.103c1.93 0 7.619-4.102 17.068-12.306 6.86-5.69 12.01-9.833 15.451-12.43.266-.19.733-.441 1.401-.753Zm-33.51 30.96c.501.137.752.384.752.74 0 .555.034 1.554.103 2.998 0 3.205-1.034 4.808-3.1 4.808-.098 0-.205-.107-.319-.32v-1.07c0-.152.32-.293.957-.422.57-.486.855-1.379.855-2.677v-3.1c0-.463.25-.782.752-.957Z"
                  ></path>
                </svg>
              </div>

              <div className="relative">
                <RoadMapComp info="گیت">
                  <svg
                    stroke="currentColor"
                    fill="currentColor"
                    stroke-width="0"
                    role="img"
                    viewBox="0 0 24 24"
                    class="h-9 w-9 md:w-10 md:h-10 z-10"
                    height="1em"
                    width="1em"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <title></title>
                    <path d="M23.546 10.93L13.067.452c-.604-.603-1.582-.603-2.188 0L8.708 2.627l2.76 2.76c.645-.215 1.379-.07 1.889.441.516.515.658 1.258.438 1.9l2.658 2.66c.645-.223 1.387-.078 1.9.435.721.72.721 1.884 0 2.604-.719.719-1.881.719-2.6 0-.539-.541-.674-1.337-.404-1.996L12.86 8.955v6.525c.176.086.342.203.488.348.713.721.713 1.883 0 2.6-.719.721-1.889.721-2.609 0-.719-.719-.719-1.879 0-2.598.182-.18.387-.316.605-.406V8.835c-.217-.091-.424-.222-.6-.401-.545-.545-.676-1.342-.396-2.009L7.636 3.7.45 10.881c-.6.605-.6 1.584 0 2.189l10.48 10.477c.604.604 1.582.604 2.186 0l10.43-10.43c.605-.603.605-1.582 0-2.187"></path>
                  </svg>
                </RoadMapComp>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 105 95"
                  fill="none"
                  class="absolute z-10 -left-10 -bottom-2 w-12 md:w-16 md:-left-16"
                >
                  <path
                    stroke="#D4D5DD"
                    stroke-linecap="round"
                    stroke-linejoin="round"
                    stroke-miterlimit="1.5"
                    stroke-width="3.015"
                    d="M2 23.472c-.207-4.269-.346-10.058.253-14.457m0 0c.07-.507 3.778.051 3.943.092 3.608.886 6.84 2.244 10.082 3.705M2.253 9.015C9.032 29.928 30.065 38.574 48.388 31.64c1.816-.688 3.793-1.437 5.738-2.337m0 0c3.098-1.433 6.117-3.248 8.283-5.8 2-2.356 3.755-5.965 2.947-8.347-1.511-4.45-8.856-2.972-12.081 1.748-2.835 4.148-2.49 10.342.85 12.399Zm0 0c.07.043.142.085.215.125 17.657 9.57 41.538-9.525 48.071-27.733"
                  ></path>
                  <path
                    fill="#D4D5DD"
                    d="M27.42 74.053c.827 0 1.784.338 2.87 1.014v.387c0 .251-1.165.407-3.497.468-1.094.288-1.953.885-2.575 1.788-.775 1.535-1.163 2.727-1.163 3.578-.16.562-.68 3.472-1.56 8.728-.517 2.31-.878 3.502-1.083 3.578h-.16c-.311-.16-.467-.498-.467-1.014 1.352-7.733 2.184-12.17 2.496-13.309.653-1.853 1.587-3.099 2.803-3.737a6.846 6.846 0 0 1 2.176-.706c0-.198.053-.456.16-.775Zm5.457 5.845h.627c1.04.395 1.56 1.269 1.56 2.62v.07h.309v1.492h-.935c-1.291 1.367-2.393 2.282-3.304 2.746-1.451.896-2.845 1.519-4.182 1.868 0 .046-.023.069-.068.069h-1.367l-1.186-.502-.375-.433v-.376h.056c.517.168.832.251.946.251h.433c1.3 0 3.46-.999 6.484-2.997.69-.622 1.067-.934 1.127-.934v-.125c-.19-.015-.5-.224-.934-.627-.372-.478-.558-.873-.558-1.185v-.25c0-.471.33-.97.991-1.493.25 0 .376-.065.376-.194Zm-.228 1.686c0 .441.44.783 1.322 1.026v-.433c0-.486-.319-.783-.957-.889-.22.099-.342.198-.365.296Zm6.928 1.151c-1.595.828-3.183 1.25-4.763 1.265v-1.686h.205c2.545.03 4.79-.969 6.734-2.997.608-.722 1.06-1.082 1.356-1.082.228 0 .346.106.353.319.015.205-.038.478-.16.82-.5 1.04-1.742 2.161-3.725 3.361Zm16.67-8.682c.828 0 1.785.338 2.87 1.014v.387c0 .251-1.165.407-3.497.468-1.094.288-1.952.885-2.575 1.788-.775 1.535-1.162 2.727-1.162 3.578-.16.562-.68 3.472-1.561 8.728-.517 2.31-.878 3.502-1.083 3.578h-.16c-.31-.16-.467-.498-.467-1.014 1.353-7.733 2.184-12.17 2.496-13.309.653-1.853 1.587-3.099 2.803-3.737a6.846 6.846 0 0 1 2.176-.706c0-.198.053-.456.16-.775Zm3.76 5.47a8.67 8.67 0 0 1 1.105-2.109c.532-.73.934-1.094 1.208-1.094.197 0 .296.1.296.297 0 .098-.186.467-.558 1.105-.228.38-.422.767-.581 1.162a7.83 7.83 0 0 0-.365 1.22c-.03.174-.057.333-.08.478a2.855 2.855 0 0 0-.034.444c-.008.236.03.445.114.627.091.174.213.315.364.421.16.107.342.19.547.251.213.053.437.08.673.08V84c-1.185.091-2.04-.27-2.564-1.082-.296-.426-.444-.965-.444-1.618 0-.259.022-.536.068-.832.053-.304.137-.62.25-.946Zm38.466-35.027h.217c.144 0 .216.107.216.32-.85 1.344-2.434 2.894-4.751 4.648-8.994 7.407-16.16 13.24-21.5 17.502-3.822 3.099-6.628 4.649-8.421 4.649-1.01-.092-1.515-.452-1.515-1.083.455-1.633 2.867-3.828 7.235-6.586 1.534-1.01 2.507-1.515 2.917-1.515l.114.216c-.114.183-2.458 2.055-7.03 5.618-1.003.866-1.505 1.44-1.505 1.72h.103c1.93 0 7.619-4.102 17.068-12.306 6.86-5.689 12.01-9.833 15.45-12.43.267-.19.734-.441 1.402-.753Zm-33.51 30.958c.502.137.752.384.752.741 0 .555.034 1.553.103 2.997 0 3.205-1.033 4.808-3.1 4.808-.098 0-.205-.106-.319-.319V82.61c0-.152.32-.293.958-.422.57-.486.854-1.378.854-2.677v-3.1c0-.463.25-.782.752-.957Z"
                  ></path>
                </svg>
              </div>

              <div className="relative">
                <RoadMapComp info="ری‌اکت">
                  <svg
                    stroke="currentColor"
                    fill="currentColor"
                    stroke-width="0"
                    role="img"
                    viewBox="0 0 24 24"
                    class="h-9 w-9 md:w-10 md:h-10 z-10"
                    height="1em"
                    width="1em"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <title></title>
                    <path d="M14.23 12.004a2.236 2.236 0 0 1-2.235 2.236 2.236 2.236 0 0 1-2.236-2.236 2.236 2.236 0 0 1 2.235-2.236 2.236 2.236 0 0 1 2.236 2.236zm2.648-10.69c-1.346 0-3.107.96-4.888 2.622-1.78-1.653-3.542-2.602-4.887-2.602-.41 0-.783.093-1.106.278-1.375.793-1.683 3.264-.973 6.365C1.98 8.917 0 10.42 0 12.004c0 1.59 1.99 3.097 5.043 4.03-.704 3.113-.39 5.588.988 6.38.32.187.69.275 1.102.275 1.345 0 3.107-.96 4.888-2.624 1.78 1.654 3.542 2.603 4.887 2.603.41 0 .783-.09 1.106-.275 1.374-.792 1.683-3.263.973-6.365C22.02 15.096 24 13.59 24 12.004c0-1.59-1.99-3.097-5.043-4.032.704-3.11.39-5.587-.988-6.38-.318-.184-.688-.277-1.092-.278zm-.005 1.09v.006c.225 0 .406.044.558.127.666.382.955 1.835.73 3.704-.054.46-.142.945-.25 1.44-.96-.236-2.006-.417-3.107-.534-.66-.905-1.345-1.727-2.035-2.447 1.592-1.48 3.087-2.292 4.105-2.295zm-9.77.02c1.012 0 2.514.808 4.11 2.28-.686.72-1.37 1.537-2.02 2.442-1.107.117-2.154.298-3.113.538-.112-.49-.195-.964-.254-1.42-.23-1.868.054-3.32.714-3.707.19-.09.4-.127.563-.132zm4.882 3.05c.455.468.91.992 1.36 1.564-.44-.02-.89-.034-1.345-.034-.46 0-.915.01-1.36.034.44-.572.895-1.096 1.345-1.565zM12 8.1c.74 0 1.477.034 2.202.093.406.582.802 1.203 1.183 1.86.372.64.71 1.29 1.018 1.946-.308.655-.646 1.31-1.013 1.95-.38.66-.773 1.288-1.18 1.87-.728.063-1.466.098-2.21.098-.74 0-1.477-.035-2.202-.093-.406-.582-.802-1.204-1.183-1.86-.372-.64-.71-1.29-1.018-1.946.303-.657.646-1.313 1.013-1.954.38-.66.773-1.286 1.18-1.868.728-.064 1.466-.098 2.21-.098zm-3.635.254c-.24.377-.48.763-.704 1.16-.225.39-.435.782-.635 1.174-.265-.656-.49-1.31-.676-1.947.64-.15 1.315-.283 2.015-.386zm7.26 0c.695.103 1.365.23 2.006.387-.18.632-.405 1.282-.66 1.933-.2-.39-.41-.783-.64-1.174-.225-.392-.465-.774-.705-1.146zm3.063.675c.484.15.944.317 1.375.498 1.732.74 2.852 1.708 2.852 2.476-.005.768-1.125 1.74-2.857 2.475-.42.18-.88.342-1.355.493-.28-.958-.646-1.956-1.1-2.98.45-1.017.81-2.01 1.085-2.964zm-13.395.004c.278.96.645 1.957 1.1 2.98-.45 1.017-.812 2.01-1.086 2.964-.484-.15-.944-.318-1.37-.5-1.732-.737-2.852-1.706-2.852-2.474 0-.768 1.12-1.742 2.852-2.476.42-.18.88-.342 1.356-.494zm11.678 4.28c.265.657.49 1.312.676 1.948-.64.157-1.316.29-2.016.39.24-.375.48-.762.705-1.158.225-.39.435-.788.636-1.18zm-9.945.02c.2.392.41.783.64 1.175.23.39.465.772.705 1.143-.695-.102-1.365-.23-2.006-.386.18-.63.406-1.282.66-1.933zM17.92 16.32c.112.493.2.968.254 1.423.23 1.868-.054 3.32-.714 3.708-.147.09-.338.128-.563.128-1.012 0-2.514-.807-4.11-2.28.686-.72 1.37-1.536 2.02-2.44 1.107-.118 2.154-.3 3.113-.54zm-11.83.01c.96.234 2.006.415 3.107.532.66.905 1.345 1.727 2.035 2.446-1.595 1.483-3.092 2.295-4.11 2.295-.22-.005-.406-.05-.553-.132-.666-.38-.955-1.834-.73-3.703.054-.46.142-.944.25-1.438zm4.56.64c.44.02.89.034 1.345.034.46 0 .915-.01 1.36-.034-.44.572-.895 1.095-1.345 1.565-.455-.47-.91-.993-1.36-1.565z"></path>
                  </svg>
                </RoadMapComp>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 113 129"
                  fill="none"
                  class="absolute -left-12 -top-6 md:-top-10 w-12 z-10 md:w-16 md:-left-20"
                >
                  <g clip-path="url(#step4_svg__a)">
                    <path
                      stroke="#D4D5DD"
                      stroke-linecap="round"
                      stroke-linejoin="round"
                      stroke-miterlimit="1.5"
                      stroke-width="3.015"
                      d="M5.97 107.677c-.542 4.258-1.143 10.022-.923 14.345m0 0c.026.498 3.633-.36 3.794-.413 3.537-1.175 6.75-2.788 9.983-4.504m-13.777 4.917c8.198-21.334 41.87-51.673 58.909-46.278 1.688.535 3.526 1.119 5.32 1.855m0 0c2.86 1.171 5.614 2.728 7.489 5.088 1.73 2.177 3.125 5.62 2.156 8.053-1.81 4.544-8.745 3.675-11.462-.752-2.387-3.89-1.557-10.073 1.819-12.39l-.001.001Zm0 0c.072-.05.144-.096.218-.142 17.73-10.95 39.125 6.077 43.929 23.638"
                    ></path>
                    <path
                      fill="#D4D5DD"
                      d="M21.992 31.053c.828 0 1.785.338 2.871 1.014v.387c0 .251-1.166.407-3.498.468-1.094.288-1.952.885-2.575 1.788-.775 1.535-1.162 2.727-1.162 3.578-.16.562-.68 3.472-1.561 8.728-.517 2.31-.878 3.502-1.083 3.578h-.16c-.31-.16-.466-.498-.466-1.014 1.352-7.733 2.183-12.17 2.495-13.309.653-1.853 1.587-3.099 2.803-3.737a6.846 6.846 0 0 1 2.176-.706c0-.198.053-.456.16-.775Zm8.317 4.91h.388a.57.57 0 0 0 .114.308c-.053.41-.145.692-.274.844-1.587 1.519-2.886 2.54-3.896 3.065-.859.547-1.88 1.033-3.066 1.458h-.922c0-.045-.065-.11-.194-.194v-.114c1.755-.828 3.555-1.914 5.4-3.258a79.397 79.397 0 0 0 2.45-2.108Zm2.029.56a8.666 8.666 0 0 1 1.105-2.109c.532-.73.934-1.094 1.208-1.094.197 0 .296.1.296.297 0 .098-.186.467-.559 1.105-.227.38-.421.767-.58 1.162a7.82 7.82 0 0 0-.365 1.22c-.03.174-.057.333-.08.478a2.843 2.843 0 0 0-.034.444c-.008.236.03.444.114.627.09.175.213.315.364.421.16.107.342.19.547.251.213.053.437.08.673.08V41c-1.185.091-2.04-.27-2.564-1.082-.296-.426-.444-.965-.444-1.618 0-.259.022-.536.068-.832.053-.304.137-.62.25-.946Zm10.357-2.633c1.45 0 2.548.767 3.293 2.302.752 1.982 1.576 2.974 2.472 2.974h.035l.239-.046.068.718c-.083.045-.209.068-.376.068h-.205c-1.086 0-2.002-.84-2.746-2.518-.122-.486-.562-1.018-1.322-1.595-.676-.456-1.356-.684-2.04-.684-.698 0-1.416.25-2.153.752-.167.053-.25.099-.25.137.57.16 1.564.33 2.985.513 1.101.212 1.652.619 1.652 1.219v.034h.08v.205c-.053 0-.08.011-.08.034 0 .897-.84 1.565-2.518 2.006-.32.076-.893.14-1.72.193h-.342l-.206.046c-.03-.03-.098-.046-.205-.046-.045 0-.068.016-.068.046l-.228-.046h-.319c-.182 0-.383-.019-.604-.057-.448.342-1.094.612-1.937.81-.311.022-.467.068-.467.136h-1.196c0-.068-.035-.102-.103-.102v-.923c.068 0 .103-.03.103-.092 1.086-.075 1.629-.167 1.629-.273-.387-.106-.782-.334-1.185-.684-.311-.311-.482-.604-.513-.877-.023 0-.034-.011-.034-.034v-.422c.023-.319.24-.71.65-1.173.774-.692 1.587-1.102 2.438-1.23.038 0 .152-.012.342-.035.06 0 .277.045.65.137.417-.22.937-.468 1.56-.74.41-.221.661-.37.752-.445v-.035h.057v.069c.76-.228 1.364-.342 1.812-.342Zm-7.099 3.874c0 .501.722.874 2.165 1.117.653-.486.98-.995.98-1.527 0-.41-.247-.737-.74-.98l-.24-.068c-.364 0-.816.133-1.356.398-.54.365-.809.718-.809 1.06Zm4.273-.684-.023.069v.205c0 .516-.186 1.06-.558 1.63v.068h.274c1.2 0 2.309-.224 3.327-.673.28-.22.421-.39.421-.512 0-.183-.421-.327-1.265-.433-1.056-.122-1.78-.24-2.176-.354Zm12.374-3.965c.069.061.24.107.513.137.433.243.73.589.889 1.037l.136.319v1.128c-.06.06-.106.262-.136.604-.251.95-.813 1.903-1.687 2.86-1.299 1.185-2.67 1.777-4.113 1.777-.046 0-.17-.08-.376-.24v-.797c.046 0 .125-.06.24-.182h.136c1.14 0 2.355-.608 3.646-1.823.782-.896 1.174-1.755 1.174-2.575 0-.638-.156-1.03-.467-1.174h-.194c-.744.16-1.603.832-2.575 2.017-.372.562-.559.969-.559 1.22v.364c.259.44.696.66 1.31.66 0 .031.031.046.092.046v.137c-.418.03-.73.046-.934.046h-.228c-.646 0-1.083-.247-1.31-.741v-.467c.083-.805.69-1.774 1.823-2.906 1.078-.934 1.902-1.401 2.472-1.401 0-.03.05-.046.148-.046Zm-1.891 9.754h.228c.364 0 .577.27.638.809v.353c0 .98-.79 2.157-2.37 3.532h-.183c0-.099.445-.85 1.334-2.256.311-.593.467-1.018.467-1.276-.03-.236-.069-.353-.114-.353-.965.653-1.447 1.234-1.447 1.743v.057c0 .106.076.376.228.809 0 .053-.057.11-.171.17-.502-.333-.752-.622-.752-.865v-.353c0-.692.577-1.444 1.731-2.256l.41-.114Zm15.895-11.816c.828 0 1.785.338 2.87 1.014v.387c0 .251-1.165.407-3.497.468-1.094.288-1.952.885-2.575 1.788-.775 1.535-1.162 2.727-1.162 3.578-.16.562-.68 3.472-1.561 8.728-.517 2.31-.878 3.502-1.083 3.578h-.16c-.31-.16-.467-.498-.467-1.014 1.353-7.733 2.184-12.17 2.496-13.309.653-1.853 1.587-3.099 2.803-3.737a6.846 6.846 0 0 1 2.176-.706c0-.198.053-.456.16-.775Zm3.76 5.47a8.67 8.67 0 0 1 1.105-2.109c.532-.73.934-1.094 1.208-1.094.197 0 .296.1.296.297 0 .098-.186.467-.558 1.105a8.35 8.35 0 0 0-.582 1.162 7.83 7.83 0 0 0-.364 1.22c-.03.174-.057.333-.08.478a2.855 2.855 0 0 0-.034.444c-.008.236.03.444.114.627.091.175.213.315.365.421.159.107.341.19.546.251.213.053.437.08.673.08V41c-1.185.091-2.04-.27-2.564-1.082-.296-.426-.444-.965-.444-1.618 0-.259.022-.536.068-.832.053-.304.137-.62.25-.946Zm38.466-35.027h.217c.144 0 .216.107.216.32-.85 1.344-2.434 2.894-4.751 4.648-8.994 7.406-16.16 13.24-21.5 17.502-3.822 3.099-6.628 4.648-8.421 4.648-1.01-.09-1.515-.451-1.515-1.082.455-1.633 2.867-3.828 7.235-6.586 1.534-1.01 2.507-1.515 2.917-1.515l.114.216c-.114.183-2.458 2.055-7.03 5.618-1.003.866-1.505 1.44-1.505 1.72h.103c1.93 0 7.619-4.102 17.068-12.305 6.86-5.69 12.01-9.834 15.451-12.432.266-.19.733-.44 1.401-.752Zm-33.51 30.958c.502.137.752.384.752.741 0 .554.034 1.553.103 2.997 0 3.205-1.033 4.808-3.1 4.808-.098 0-.205-.106-.319-.319V39.61c0-.152.32-.292.958-.422.57-.486.854-1.378.854-2.677v-3.1c0-.463.25-.782.752-.957Z"
                    ></path>
                  </g>
                  <defs>
                    <clipPath id="step4_svg__a">
                      <path fill="#fff" d="M0 0h113v129H0z"></path>
                    </clipPath>
                  </defs>
                </svg>
              </div>

              <div className="relative">
                <RoadMapComp info="تیلویند">
                  <svg
                    stroke="currentColor"
                    fill="currentColor"
                    stroke-width="0"
                    role="img"
                    viewBox="0 0 24 24"
                    class="h-9 w-9 md:w-10 md:h-10 z-10"
                    height="1em"
                    width="1em"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <title></title>
                    <path d="M12.001,4.8c-3.2,0-5.2,1.6-6,4.8c1.2-1.6,2.6-2.2,4.2-1.8c0.913,0.228,1.565,0.89,2.288,1.624 C13.666,10.618,15.027,12,18.001,12c3.2,0,5.2-1.6,6-4.8c-1.2,1.6-2.6,2.2-4.2,1.8c-0.913-0.228-1.565-0.89-2.288-1.624 C16.337,6.182,14.976,4.8,12.001,4.8z M6.001,12c-3.2,0-5.2,1.6-6,4.8c1.2-1.6,2.6-2.2,4.2-1.8c0.913,0.228,1.565,0.89,2.288,1.624 c1.177,1.194,2.538,2.576,5.512,2.576c3.2,0,5.2-1.6,6-4.8c-1.2,1.6-2.6,2.2-4.2,1.8c-0.913-0.228-1.565-0.89-2.288-1.624 C10.337,13.382,8.976,12,6.001,12z"></path>
                  </svg>
                </RoadMapComp>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 105 95"
                  fill="none"
                  class="absolute -left-10 -bottom-2 w-12 md:w-16 md:-left-16"
                >
                  <path
                    stroke="#D4D5DD"
                    stroke-linecap="round"
                    stroke-linejoin="round"
                    stroke-miterlimit="1.5"
                    stroke-width="3.015"
                    d="M2 23.472c-.207-4.269-.346-10.058.253-14.457m0 0c.07-.507 3.778.051 3.943.092 3.608.886 6.84 2.244 10.082 3.705M2.253 9.015C9.032 29.928 30.065 38.574 48.388 31.64c1.816-.688 3.793-1.437 5.738-2.337m0 0c3.098-1.433 6.117-3.248 8.283-5.8 2-2.356 3.755-5.965 2.947-8.347-1.511-4.45-8.856-2.972-12.081 1.748-2.835 4.148-2.49 10.342.85 12.399Zm0 0c.07.043.142.085.215.125 17.657 9.57 41.538-9.525 48.071-27.733"
                  ></path>
                  <path
                    fill="#D4D5DD"
                    d="M14.66 79.397h.206v.205c-3.419 2.377-5.489 4.702-6.21 6.973-.137.456-.205.828-.205 1.117v.911c0 .843.65 1.842 1.948 2.997 1.178.76 2.317 1.177 3.418 1.253h1.197c1.67 0 3.9-1.113 6.688-3.338 0-.144.027-.217.08-.217 0-.402-.862-.634-2.587-.695-2.104 0-3.384-.512-3.84-1.538a.831.831 0 0 1-.136-.422v-.136c0-.714 1.117-1.622 3.35-2.724h.137v1.265c0 .069-.487.391-1.459.969-.235.175-.353.36-.353.558 0 .403.908.684 2.723.843 1.861 0 3 .372 3.418 1.117 0 .091.046.137.137.137v1.116c-.091 0-.232.232-.422.695-2.043 1.892-4.04 3.103-5.993 3.635-.889.182-1.82.32-2.792.41-.926 0-2.115-.3-3.566-.9a11.33 11.33 0 0 1-1.743-1.333c-1.048-1.208-1.607-2.298-1.675-3.27-.046 0-.068-.095-.068-.285v-1.048c0-.881.63-2.184 1.891-3.908 1.55-1.649 2.689-2.648 3.418-2.997 1.276-.927 2.09-1.39 2.439-1.39Zm3.738 9.468c.342-.212.737-.38 1.185-.501a5.648 5.648 0 0 1 1.481-.182c.243 0 .452.011.627.034.175.023.338.057.49.102.341.122.512.251.512.388 0 .182-.258.292-.774.33a7.206 7.206 0 0 0-1.63.228 11.07 11.07 0 0 0-1.56.536c-.061.015-.11.03-.149.045a.405.405 0 0 1-.148.023c-.342 0-.513-.137-.513-.41 0-.175.16-.372.479-.593Zm2.495-9.15h.547c.137 0 .25.293.342.878v.137c0 1.565-.726 2.602-2.176 3.11-.175.076-.6.145-1.277.206-.273-.069-.41-.228-.41-.479v-.672c0-.069.091-.16.274-.274h.273c1.071 0 1.747-.493 2.028-1.48 0-.897.133-1.372.4-1.425Zm2.7-.193a8.673 8.673 0 0 1 1.106-2.108c.532-.73.934-1.094 1.208-1.094.197 0 .296.1.296.297 0 .098-.186.467-.558 1.105a8.35 8.35 0 0 0-.582 1.162 7.83 7.83 0 0 0-.364 1.22c-.03.174-.057.333-.08.478a2.843 2.843 0 0 0-.034.444c-.008.236.03.445.114.627.091.174.212.315.364.421.16.107.342.19.547.251.213.053.437.08.673.08V84c-1.185.091-2.04-.27-2.564-1.082-.296-.426-.444-.965-.444-1.618 0-.259.022-.536.068-.832.053-.304.137-.62.25-.946Zm10.358-2.632c1.45 0 2.548.767 3.293 2.302.752 1.982 1.576 2.974 2.472 2.974h.035l.239-.046.068.718c-.083.045-.209.068-.376.068h-.205c-1.086 0-2.002-.84-2.746-2.518-.122-.486-.562-1.018-1.322-1.595-.676-.456-1.356-.684-2.04-.684-.698 0-1.416.25-2.153.752-.167.053-.25.099-.25.137.57.16 1.564.33 2.985.513 1.101.212 1.652.619 1.652 1.219v.034h.08v.205c-.053 0-.08.012-.08.034 0 .897-.84 1.565-2.518 2.006-.32.076-.893.14-1.72.193h-.342l-.206.046c-.03-.03-.098-.046-.205-.046-.045 0-.068.016-.068.046l-.228-.046h-.319c-.182 0-.384-.019-.604-.057-.448.342-1.094.612-1.937.81-.311.022-.467.068-.467.136h-1.196c0-.068-.034-.102-.103-.102v-.923c.069 0 .103-.03.103-.091 1.086-.076 1.629-.168 1.629-.274-.387-.106-.782-.334-1.185-.684-.311-.311-.482-.603-.513-.877-.023 0-.034-.011-.034-.034v-.422c.023-.319.24-.71.65-1.173.774-.691 1.587-1.102 2.438-1.23.038 0 .152-.012.342-.035.06 0 .277.046.65.137.417-.22.937-.468 1.56-.74.41-.221.661-.37.752-.445v-.034h.057v.068c.76-.228 1.364-.342 1.812-.342Zm-7.099 3.874c0 .501.722.874 2.165 1.117.654-.487.98-.995.98-1.527 0-.41-.247-.737-.74-.98l-.24-.068c-.364 0-.816.133-1.356.398-.539.365-.809.718-.809 1.06Zm4.273-.684-.023.069v.205c0 .516-.186 1.06-.558 1.63v.068h.273c1.2 0 2.31-.225 3.328-.673.28-.22.421-.39.421-.512 0-.183-.421-.327-1.265-.433-1.055-.122-1.78-.24-2.176-.354Zm10.87-6.141c.099-.099.194-.175.285-.228a.506.506 0 0 1 .285-.091c.197 0 .35.102.456.308a.967.967 0 0 1 .125.58c-.122.692-.414 1.038-.877 1.038-.44 0-.661-.236-.661-.707a.98.98 0 0 1 .102-.444c.069-.137.164-.289.285-.456Zm.08 5.435h.592c.145 0 .266.315.365.946v.148c0 1.686-.782 2.807-2.347 3.361-.19.076-.65.148-1.379.217-.296-.076-.444-.247-.444-.513v-.73c0-.075.099-.174.296-.296h.296c1.155 0 1.884-.531 2.188-1.595 0-.972.144-1.485.433-1.538Zm13.172-5.321c.828 0 1.785.338 2.87 1.014v.387c0 .251-1.165.407-3.497.468-1.094.288-1.952.885-2.575 1.788-.775 1.535-1.162 2.727-1.162 3.578-.16.562-.68 3.472-1.561 8.728-.517 2.31-.878 3.502-1.083 3.578h-.16c-.31-.16-.467-.498-.467-1.014 1.353-7.733 2.184-12.17 2.496-13.309.653-1.853 1.587-3.099 2.803-3.737a6.846 6.846 0 0 1 2.176-.706c0-.198.053-.456.16-.775Zm3.76 5.47a8.67 8.67 0 0 1 1.105-2.109c.532-.73.934-1.094 1.208-1.094.197 0 .296.1.296.297 0 .098-.186.467-.558 1.105-.228.38-.422.767-.581 1.162a7.83 7.83 0 0 0-.365 1.22c-.03.174-.057.333-.08.478a2.855 2.855 0 0 0-.034.444c-.008.236.03.445.114.627.091.174.213.315.364.421.16.107.342.19.547.251.213.053.437.08.673.08V84c-1.185.091-2.04-.27-2.564-1.082-.296-.426-.444-.965-.444-1.618 0-.259.022-.536.068-.832.053-.304.137-.62.25-.946Zm38.466-35.027h.217c.144 0 .216.107.216.32-.85 1.344-2.434 2.894-4.751 4.648-8.994 7.407-16.16 13.24-21.5 17.502-3.822 3.099-6.628 4.649-8.421 4.649-1.01-.092-1.516-.452-1.516-1.083.456-1.633 2.868-3.828 7.236-6.586 1.534-1.01 2.507-1.515 2.917-1.515l.114.216c-.114.183-2.458 2.055-7.03 5.618-1.003.866-1.505 1.44-1.505 1.72h.103c1.93 0 7.619-4.102 17.068-12.306 6.86-5.689 12.01-9.833 15.45-12.43.267-.19.734-.441 1.402-.753Zm-33.51 30.958c.502.137.752.384.752.741 0 .555.034 1.553.103 2.997 0 3.205-1.033 4.808-3.1 4.808-.098 0-.205-.106-.319-.319V82.61c0-.152.32-.293.958-.422.57-.486.854-1.378.854-2.677v-3.1c0-.463.25-.782.752-.957Z"
                  ></path>
                </svg>
              </div>

              <div className="relative">
                <RoadMapComp info="نکست">
                  <svg
                    stroke="currentColor"
                    fill="currentColor"
                    stroke-width="0"
                    role="img"
                    viewBox="0 0 24 24"
                    class="h-9 w-9 md:w-10 md:h-10 z-10"
                    height="1em"
                    width="1em"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <title></title>
                    <path d="M11.5725 0c-.1763 0-.3098.0013-.3584.0067-.0516.0053-.2159.021-.3636.0328-3.4088.3073-6.6017 2.1463-8.624 4.9728C1.1004 6.584.3802 8.3666.1082 10.255c-.0962.659-.108.8537-.108 1.7474s.012 1.0884.108 1.7476c.652 4.506 3.8591 8.2919 8.2087 9.6945.7789.2511 1.6.4223 2.5337.5255.3636.04 1.9354.04 2.299 0 1.6117-.1783 2.9772-.577 4.3237-1.2643.2065-.1056.2464-.1337.2183-.1573-.0188-.0139-.8987-1.1938-1.9543-2.62l-1.919-2.592-2.4047-3.5583c-1.3231-1.9564-2.4117-3.556-2.4211-3.556-.0094-.0026-.0187 1.5787-.0235 3.509-.0067 3.3802-.0093 3.5162-.0516 3.596-.061.115-.108.1618-.2064.2134-.075.0374-.1408.0445-.495.0445h-.406l-.1078-.068a.4383.4383 0 01-.1572-.1712l-.0493-.1056.0053-4.703.0067-4.7054.0726-.0915c.0376-.0493.1174-.1125.1736-.143.0962-.047.1338-.0517.5396-.0517.4787 0 .5584.0187.6827.1547.0353.0377 1.3373 1.9987 2.895 4.3608a10760.433 10760.433 0 004.7344 7.1706l1.9002 2.8782.096-.0633c.8518-.5536 1.7525-1.3418 2.4657-2.1627 1.5179-1.7429 2.4963-3.868 2.8247-6.134.0961-.6591.1078-.854.1078-1.7475 0-.8937-.012-1.0884-.1078-1.7476-.6522-4.506-3.8592-8.2919-8.2087-9.6945-.7672-.2487-1.5836-.42-2.4985-.5232-.169-.0176-1.0835-.0366-1.6123-.037zm4.0685 7.217c.3473 0 .4082.0053.4857.047.1127.0562.204.1642.237.2767.0186.061.0234 1.3653.0186 4.3044l-.0067 4.2175-.7436-1.14-.7461-1.14v-3.066c0-1.982.0093-3.0963.0234-3.1502.0375-.1313.1196-.2346.2323-.2955.0961-.0494.1313-.054.4997-.054z"></path>
                  </svg>
                </RoadMapComp>
              </div>
            </div>
          </div>
        </div>
      </section>

      <div className="h-[1000px] w-16 bg-white-500"></div>
    </div>
  );
};

export default Main;
